Repository: sszperling/cv
Catalog: cv.*.po
Languages: es_ar

source: they/she/he
es_ar: elle/ella/él

source: I'm a Senior Mobile Developer specialized on Android. I work on making apps more stable and performant, creating scalable architectures and always keeping up-to-date with efficient and easy-to-use technologies.
es_ar: Soy une Desarrolladore Mobile Senior. Trabajo haciendo aplicaciones más estables y performantes, con arquitecturas escalables y siempre trayendo las últimas tecnologías eficientes y fáciles de usar.

source: Work Experience
es_ar: Experiencia Laboral

source: May 2022 - present
es_ar: May 2022 - Actualidad

source: Lead developer for several B2B applications for Android and iOS
es_ar: Rol principal en el desarrollo de varias aplicaciones B2B para Android y iOS

source: Lead developer and Architect for large migrations of legacy code to Jetpack Compose and SwiftUI
es_ar: Desarrolladore principal y Arquitecte de migraciones de código legado a Jetpack Compose y SwiftUI

source: Responsible for designing and implementing stability, testability and metric monitoring improvements
es_ar: Responsable de diseñar e implementar mejoras en las estabilidad, testeabilidad y monitoreos de métricas

source: Coaching and instructing developers with less seniority on security and Android development practices
es_ar: Capacitacion de desarrolladores de menor seniority on prácticas de seguridad y desarrollo de Android

source: Development of two B2B applications for Android and iOS
es_ar: Desarrollo de dos aplicaciones B2B para Android y iOS

source: Development and maintenance of new and existing features in React Native
es_ar: Desarrollo y mantenimiento de características nuevas y existentes en React Native

source: Quality monitoring using Crashlytics and AppDynamics for release stability improvement
es_ar: Monitoreo de calidad usando Crashlytics y AppDynamics para mejoras en estabilidad de la aplicación

source: Software Engineer
es_ar: Ingeniere de Software

source: Development and maintenance of Java, Scala and Kotlin applications
es_ar: Desarrollo y mantenimiento de aplicaciones para en Java, Scala y Kotlin

source: Management and monitoring of data infrastructure
es_ar: Gestión y monitoreo de infraestructura de datos

source: Service modernization and resource optimization on AWS
es_ar: Modernización de servicios y optimización de recursos de AWS

source: Jun 2016 - Jun 2019
es_ar: Jun 2016 - May 2019

source: Android Developer
es_ar: Analista Desarrollador Android

source: Development of two applications with over 250k daily active users
es_ar: Desarrollo de dos aplicaciones con más 250k usuarios diarios

source: Architecture design with reusable patterns for better scalability
es_ar: Diseño de arquitectura con patrones reutilizables para mejor escalabilidad

source: Monitoring and improvement of technical metrics (Error Rate, ANR, APK size)
es_ar: Monitoreo y mejoramiento de métricas técnicas (Error Rate, ANR, APK size)

source: Automated UI Testing with Robotium and UIAutomator
es_ar: Testing de UI automatizado con Robotium y UIAutomator

source: Participation in training process on technologies across the entire stack: backend, frontend, QA/Automation
es_ar: Participación en proceso de entrenamiento con tecnologías de todo el stack: back-end, front-end, QA/Automation

source: Technical Skills
es_ar: Conocimientos técnicos

source: Programming Languages
es_ar: Lenguajes de programación

source: Frameworks and libraries
es_ar: Frameworks y bibliotecas

source: Tools
es_ar: Herramientas

source: Other
es_ar: Otros

source: Object Oriented and Functional Programming
es_ar: Programación orientada a Objetos y Programación Funcional

source: Formal Education
es_ar: Formación

source: MSc Computer Science, Universidad de Buenos Aires
es_ar: Lic. en Ciencias de la Computación, Universidad de Buenos Aires

source: University
es_ar: Universidad

source: Colegio Nacional de Buenos Aires
es_ar: Colegio Nacional de Buenos Aires, Bachiller

source: High School
es_ar: Secundario

source: Languages
es_ar: Idiomas

source: English
es_ar: Inglés

source: Bilingual oral and written
es_ar: Oral y escrito bilingüe

source: French
es_ar: Francés

source: Basic written
es_ar: Escrito básico

source: Swedish
es_ar: Sueco

source: Basic oral and written
es_ar: Oral y escrito básico

source: Personal Projects and Activities
es_ar: Actividades y Proyectos personales

source: Project
es_ar: Proyecto

source: Fork of WicketPixie Wordpress theme: optimization, several new features and general maintentance
es_ar: Fork del tema para Wordpress WicketPixie: optimización, varias funciones nuevas y mantenimiento general

source: Event
es_ar: Evento

source: Participation in 2014 Game Work Jam: programming with Unity3D, JavaScript and C\#
es_ar: Participación en la Game Work Jam 2014: programación con Unity3D, JavaScript y C\#
